//====================================================
// BaseAuxiliary : 補助
//====================================================

#include "BaseAuxiliary.h"

using namespace Game;

//==================================
//　コンストラクタ
//==================================
BaseAuxiliary::BaseAuxiliary()
{

};

//==================================
//　デストラクタ
//==================================
BaseAuxiliary::~BaseAuxiliary()
{

}

//==================================
//　Release
//　自分自身を削除
//==================================
void BaseAuxiliary::Release()
{
	if (this == nullptr) return;

	delete this;
}

